Revit 2026 API
LoadedFamilyIntegrityCheck Class
 Functions for checking the integrity of loaded families.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LoadedFamilyIntegrityCheck
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class LoadedFamilyIntegrityCheck
Public NotInheritable Class LoadedFamilyIntegrityCheck
public ref class LoadedFamilyIntegrityCheck abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LoadedFamilyIntegrityCheck = class end
The LoadedFamilyIntegrityCheck type exposes the following members.
Methods
Name | Description
CheckAllFamilies
CheckAllFamiliesSlow
CheckFamily |  Check that the loaded family has its content document.
Top
See Also
Reference
Autodesk.Revit.DB Namespace